---
kind: type
id: T:Autodesk.Revit.DB.ExtensibleStorage.AccessLevel
source: html/60600a74-450d-a175-ce3d-12e91fb22cd2.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.AccessLevel

Defines access levels to objects in the Extensible Storage framework.

## Syntax (C#)
```csharp
public enum AccessLevel
```